//Задание 1. Дан массив mas. Выведите его на страницу HTML в формате индекс элемента — значение (через три дефиса). Каждый элемент с новой строки.
// mas = [15, 'hello', 'trump', 23, 'world', 999, 176];
// var i = 0;
// while (i <= mas.length -1) {
//     document.write(i + '---' + mas[i] + '<br>');
//     ++i;
// }

//Задание 2. Дан массив mas. Выведите его на страницу HTML в формате индекс элемента — значение (через дефис). Каждый элемент с новой строки. Выводить нужно те элементы, значение которых больше пяти (5).
// var mas = [2, 3, 4, 5, 6, 4, 77, 32, 4];
// var i = 0;
// while (i <= mas.length - 1) {
//     if (mas[i] > 5) {
//         document.write(i + '---' + mas[i] + '<br>');
//     }
//     ++i;
// }
