///////////////2 Задание
var c = 15;
var b = 2;
var result = c + b;

alert('2 задание = ' + result);


///////////////3 задание
var a3=10, b3=2, c3=5, sum;

sum = a3 + b3 + c3;

alert('3 задание = ' + sum);


///////////////4, 5 задание
var a4 = 17, b4 = 10, с;
с = a4 - b4;
var d = 7;
var result4 = c + d;
alert('4, 5 задание = ' + result4);


//////////////////6 задание
var str = 'Привет, Мир!';
alert('6 задание = ' + str);

//////////////////7 задание
var str1='Привет,', str2='Мир!';
alert('7 задание = ' + str1 + ' ' + str2);

////////////////////8 задание
var name  = prompt('Введите имя');
alert('8 задание ' + 'Привет ' + name +'!');

////////////////////9 задание
var age = prompt('Введите ваш возраст');
alert('9 задание ' + 'Мне ' + age + ' лет!');
